import React, { useState } from 'react'
import { PiPlus, PiMinus } from 'react-icons/pi'
import FaqItem from '../Ui/FaqItem'

const faqs = [
    {
        id: 1,
        question: 'میزبانی وب چیست؟',
        answer: `سرویس میزبانی وب برای سایت‌های کم بازدید و کاربرانی که آشنایی زیادی با مسائل فنی ندارند، بهترین گزینه است. در این سرویس شما بخشی از سرور را اجاره می‌کنید و منابع آن را با سایر کاربران به صورت اشتراکی استفاده می کنید. هاست اشتراکی نسبت به سرور مجازی و اختصاصی قیمت بسیار کمتری داشته و نیاز به مدیریت زیادی ندارد.`
    },
    {
        id: 2,
        question: 'تفاوت هاست اشتراکی و سرور مجازی چیست؟',
        answer: `در سرویس‌های میزبانی وب، تمامی تنظیمات و مدیریت کلی سرور توسط متخصصان فنی سرور و دیتاسنتر انجام می‌شود و منابع سرور به صورت اشتراکی به کاربران ارائه می‌شود.

در سرور‌های مجازی، منابع اختصاصی در اختیار کاربر قرار می‌گیرد و سیستم عامل مورد نظر نیز بر روی سرور مجازی نصب می‌شود؛ اما تمامی تنظیمات و مدیریت سرور برعهده کاربر است.`
    },
    {
        id: 3,
        question: 'چگونه می‌توان دامنه سایت را ثبت و خریداری کرد؟',
        answer: `نام دامنه همان آدرس اصلی وبسایت و نشان‌دهنده هویت آن است.

شما می‌توانید نام دامنه مورد نظر خود را از اینجا انتخاب و به سبد خرید خود اضافه کنید.`
    },
    {
        id: 4,
        question: 'چگونه بیشتر درباره سرویس‌های برتینا بدانید؟',
        answer: `جهت دریافت اطلاعات بیشتر و ارتباط تلفنی با مشاوران برتینا می‌توانید در روزهای کاری از ساعت ۹ الی ۱۷ با شماره تماس ۰۲۱-۶۱۰۶۴ داخلی ۶۱۳ تماس بگیرید.
همچنین می‌توانید از اینجا نسبت به ارسال تیکت برای دپارتمان مورد نظر خود اقدام کنید.`
    },
    {
        id: 5,
        question: 'چگونه سرویس‌های خریداری شده خود را تمدید کنید؟',
        answer: `جهت تمدید سرویس یا دامنه خود می‌توانید از طریق ناحیه کاربری برتینا و بخش سرویس‌های من اقدام کنید.

همچنین ۷ روز مانده به موعد تمدید سرویس یا دامنه، صورتحساب مربوطه در پنل کاربری شما به صورت خودکار ایجاد می‌شود.`
    }
]

function FAQSection() {
    const [openIndex, setOpenIndex] = useState()

    const toggleItem = (index) => {
        setOpenIndex(openIndex === index ? null : index)
    }

    return (
        <section className="mb-20">
            <div className="flex flex-col items-center justify-center">
                <h1 className="text-2xl font-bold mb-6">پرسش‌های متداول</h1>
                {faqs.map((item, index) => (
                  <FaqItem item={item} openIndex={openIndex} toggleItem={toggleItem}/>
                ))}
            </div>
        </section>
    )
}

export default FAQSection
